RafaelLaya/tm4c1294ncpdt_drivers/drivers/tm4c1294ncpdt/inc/tm4c1294ncpdt_tim.h
#pragma once

#include "tm4c1294ncpdt.h"

typedef struct {
    uint8_t PeriodicModeCommand;                    /* ENABLE or DISABLE */
    uint8_t TIM_Direction;                          /* Value from @TIM_Direction */
    uint8_t TIM_SnapshotCommand;                    /* ENABLE or DISABLE */
    uint8_t TIM_WaitOnTriggerCommand;               /* ENABLE or DISABLE */
    uint8_t TIM_CompareAction;                      /* Value from @TIM_CompareAction */
} TIM_Init_t;

typedef struct {
    uint8_t TIM_Direction;                          /* Value From @TIM_Direction */
    uint8_t TIM_EdgeEvent;                          /* Value from @TIM_EventMode */
    uint8_t TIM_EdgeCaptureMode;                    /* TIM_Mode_Capture_EdgeX where X is Count or Time */      
} TIM_InitEdgeCount_t;

/* @TIM_ModuleConfig */
#define TIM_ModuleConfig_32BIT              0x0U
#define TIM_ModuleConfig_RTC                0x1U
#define TIM_ModuleConfig_16BIT              0x4U

/* @TIM_Mode */
#define TIM_Mode_OneShot                0x1U
#define TIM_Mode_Periodic               0x2U
#define TIM_Mode_Capture_EdgeCount      0x3U
#define TIM_Mode_Capture_EdgeTime       0x4U
#define TIM_Mode_PWM                    0x5U
#define TIM_Mode_RTC                    0x6U

#define TIM_IS_MODE(X)                ((X) >= TIM_Mode_OneShot && (X) <= TIM_Mode_RTC)

// GPTMCFG Masks
#define TIM_GPTMCFG_MASK                    0x7U
#define TIM_IS_MODULE_CONFIG(X)              ((X) == TIM_ModuleConfig_32BIT     ||     \
                                              (X) == TIM_ModuleConfig_RTC       ||     \
                                              (X) == TIM_ModuleConfig_16BIT)

/* @TIM_Direction */
#define TIM_Direction_UP            0x1U
#define TIM_Direction_DOWN          0x0U

#define TIM_IS_DIRECTION(X)                    ((X) == TIM_Direction_UP || \
                                             (X) == TIM_Direction_DOWN)

/* @TIM_Port */
#define TIM_Port_A                      0x1U
#define TIM_Port_B                      0x2U
#define TIM_Port_Concatenated           0x3U

#define TIM_IS_PORT(X)                             ((X) == TIM_Port_A ||  \
                                                    (X) == TIM_Port_B ||  \
                                                    (X) == TIM_Port_Concatenated)

#define TIM_IS_INDIVIDUAL_PORT(X)                      ((X) == TIM_Port_A || \
                                                        (X) == TIM_Port_B)

#define TIM_IS_CONCATENATED_PORT(X)                    ((X) == TIM_Port_Concatenated)

/* @TIM_Match_Update */
#define TIM_MatchUpdate_NextCycle       0x1U
#define TIM_MatchUpdate_NextTimeout     0x2U

#define TIM_IS_MATCH_UPDATE(X)                          ((X) == TIM_MatchUpdate_NextCycle || \
                                                         (X) == TIM_MatchUpdate_NextTimeout)

/* @TIM_CompareAction */ 
#define TIM_CompareAction_Disable                       0x0U
#define TIM_CompareAction_ToggleOnTimeout               0x1U
#define TIM_CompareAction_ClearOnTimeout                0x2U
#define TIM_CompareAction_SetOnTimeout                  0x3U
#define TIM_CompareAction_SetNowToggleOnTimeout         0x4U
#define TIM_CompareAction_ClearNowToggleOnTimeout       0x5U
#define TIM_CompareAction_SetNowClearOnTimeout          0x6U
#define TIM_CompareAction_ClearNowSetOnTimeout          0x7U

#define TIM_IS_COMPARE_ACTION(X)                        ((X) >= TIM_CompareAction_Disable && \
                                                         (X) <= TIM_CompareAction_ClearNowSetOnTimeout)

/* @TIM_EventMode */ 
#define TIM_EventMode_PositiveEdge          0x0U
#define TIM_EventMode_NegativeEdge          0x1U
#define TIM_EventMode_BothEdges             0x3U

#define TIM_IS_EVENT_MODE(X)                               ((X) == TIM_EventMode_PositiveEdge || \
                                                            (X) == TIM_EventMode_NegativeEdge || \
                                                            (X) == TIM_EventMode_BothEdges)

/* @TIM_IRQ */
#define TIM_IRQ_TimeoutA                    TIM_IMR_TATOIM_MASK
#define TIM_IRQ_CaptureMatchA               TIM_IMR_CAMIM_MASK
#define TIM_IRQ_CaptureEventA               TIM_IMR_CAEIM_MASK
#define TIM_IRQ_RTC                         TIM_IMR_RTCIM_MASK
#define TIM_IRQ_MatchA                      TIM_IMR_TAMIM_MASK
#define TIM_IRQ_DMADoneA                    TIM_IMR_DMAAIM_MASK
#define TIM_IRQ_TimeoutB                    TIM_IMR_TBTOIM_MASK
#define TIM_IRQ_CaptureMatchB               TIM_IMR_CBEIM_MASK
#define TIM_IRQ_CaptureEventB               TIM_IMR_CBEIM_MASK   
#define TIM_IRQ_MatchB                      TIM_IMR_TBMIM_MASK
#define TIM_IRQ_DMADoneB                    TIM_IMR_DMABIM_MASK
#define TIM_IRQ_ALL                         (TIM_IRQ_TimeoutA | TIM_IRQ_CaptureMatchA | TIM_IRQ_CaptureEventA |  \
                                             TIM_IRQ_RTC      | TIM_IRQ_MatchA        | TIM_IRQ_DMADoneA      |  \
                                             TIM_IRQ_TimeoutB | TIM_IRQ_CaptureMatchB | TIM_IRQ_CaptureEventB |  \
                                             TIM_IRQ_MatchB   | TIM_IRQ_DMADoneB)

// Allows for zero 
#define TIM_IS_IRQ_MASK_COMBINATION(X)      (((X) & ~(0x2F3FU)) == 0U)

/* @TIM_ITReadPos */ 
#define TIM_ITReadPos_TimeoutA              0U
#define TIM_ITReadPos_CaptureMatchA         1U
#define TIM_ITReadPos_CaptureEventA         2U
#define TIM_ITReadPos_RTC                   3U
#define TIM_ITReadPos_MatchA                4U
#define TIM_ITReadPos_DMADoneA              5U
#define TIM_ITReadPos_TimeoutB              8U
#define TIM_ITReadPos_CaptureMatchB         9U
#define TIM_ITReadPos_CaptureEventB         10U
#define TIM_ITReadPos_MatchB                11U
#define TIM_ITReadPos_DMADoneB              13U

#define TIM_IS_ITREAD_POS(X)                ((X) >= TIM_ITReadPos_TimeoutA && \
                                             (X) <= TIM_ITReadPos_DMADoneB && \
                                             (X) !=  6U                    && \
                                             (X) !=  7U                    && \
                                             (X) != 12U)

/* @TIM_ADCEV_Masks */
#define TIM_ADCEvent_TimeoutA                  0x1U
#define TIM_ADCEvent_CaptureMatchA             0x2U
#define TIM_ADCEvent_CaptureEventA             0x4U
#define TIM_ADCEvent_RTCMatch                  0x8U
#define TIM_ADCEvent_MatchA                    0x10U
#define TIM_ADCEvent_TimeoutB                  0x100U
#define TIM_ADCEvent_CaptureMatchB             0x200U
#define TIM_ADCEvent_CaptureEventB             0x400U
#define TIM_ADCEvent_MatchB                    0x800U
    
// Allows for zero
#define TIM_IS_ADC_EVENT_MASK_COMBINATION(X)                (((X) & ~(0xF1FU)) == 0U)     

